#### Infrastructure Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.aws_iam_role.lab_role: Reading...
aws_ecr_repository.payments: Refreshing state... [id=tech-challenge-payments]
aws_ecr_repository.customer: Refreshing state... [id=tech-challenge-customer]
aws_ecr_repository.orders: Refreshing state... [id=tech-challenge-orders]
aws_vpc.main: Refreshing state... [id=vpc-05fd28ebd918c94ed]
data.aws_iam_role.lab_role: Read complete after 0s [id=LabRole]
aws_ecr_lifecycle_policy.customer: Refreshing state... [id=tech-challenge-customer]
aws_ecr_lifecycle_policy.payments: Refreshing state... [id=tech-challenge-payments]
aws_ecr_lifecycle_policy.orders: Refreshing state... [id=tech-challenge-orders]
aws_security_group.eks_cluster: Refreshing state... [id=sg-0276f7f7dcb444689]
aws_internet_gateway.main: Refreshing state... [id=igw-0e0e5d221d944409a]
aws_subnet.private[1]: Refreshing state... [id=subnet-015cc3ada7d5a2f6c]
aws_subnet.public[0]: Refreshing state... [id=subnet-06cbb5afa52da5e80]
aws_subnet.private[0]: Refreshing state... [id=subnet-0ec70e5f5ce9f8b81]
aws_subnet.public[1]: Refreshing state... [id=subnet-0291cc057ebf7fb4b]
aws_eip.nat: Refreshing state... [id=eipalloc-03a9876608f998612]
aws_route_table.public: Refreshing state... [id=rtb-0a413ecd77b9fe4c0]
aws_eks_cluster.main: Refreshing state... [id=tech-challenge-cluster]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e1ec87ebc18ec150]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-08b5fa23f51bed47e]
aws_nat_gateway.main: Refreshing state... [id=nat-04e3d1273a4a7232b]
aws_route_table.private: Refreshing state... [id=rtb-0e6a49acd37e85ccc]
data.aws_eks_cluster_auth.cluster: Reading...
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=tech-challenge-cluster]
aws_eks_node_group.main: Refreshing state... [id=tech-challenge-cluster:tech-challenge-node-group]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d84bc54ec8727e57]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b542ddb065210b0d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_namespace.tech_challenge will be created
  + resource "kubernetes_namespace" "tech_challenge" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "environment" = "production"
              + "name"        = "tech-challenge"
            }
          + name             = "tech-challenge"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kubernetes_namespace          = "tech-challenge"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @TheMyFish, Action: `pull_request`*